OpenROAD bdc8e944cd08ba8edebeca19fa531bd026690330 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
pdk(libs) defined as:
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_sc_mcu7t5v0/liberty/gf180mcu_fd_sc_mcu7t5v0__tt_025C_5v00.lib
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_io/liberty/gf180mcu_fd_io__tt_025C_5v00.lib
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/liberty/gf180mcu_fd_ip_sram__sram128x8m8wm1__tt_025C_5v00.lib
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/liberty/gf180mcu_fd_ip_sram__sram256x8m8wm1__tt_025C_5v00.lib
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/liberty/gf180mcu_fd_ip_sram__sram512x8m8wm1__tt_025C_5v00.lib
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/liberty/gf180mcu_fd_ip_sram__sram64x8m8wm1__tt_025C_5v00.lib
pdk(lefs) defined as:
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_sc_mcu7t5v0/techlef/gf180mcu_fd_sc_mcu7t5v0__nom.tlef
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_sc_mcu7t5v0/lef/gf180mcu_fd_sc_mcu7t5v0.lef
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_io/lef/gf180mcu_fd_io.lef
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram128x8m8wm1.lef
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram256x8m8wm1.lef
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram512x8m8wm1.lef
/home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram64x8m8wm1.lef
verilog exception: /home/jangarita/ADC_LogiCompilation/caravel/verilog/gl/__user_analog_project_wrapper.v
removing /home/jangarita/ADC_LogiCompilation/caravel/verilog/gl/__user_analog_project_wrapper.v from verilogs list
verilog exception: /home/jangarita/ADC_LogiCompilation/caravel/verilog/gl/caravel-signoff.v
removing /home/jangarita/ADC_LogiCompilation/caravel/verilog/gl/caravel-signoff.v from verilogs list
verilog exception: /home/jangarita/ADC_LogiCompilation/caravel/verilog/gl/caravan-signoff.v
removing /home/jangarita/ADC_LogiCompilation/caravel/verilog/gl/caravan-signoff.v from verilogs list
verilog exception: /home/jangarita/ADC_LogiCompilation/caravel/verilog/gl/__user_project_wrapper.v
removing /home/jangarita/ADC_LogiCompilation/caravel/verilog/gl/__user_project_wrapper.v from verilogs list
exec> read_liberty /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_sc_mcu7t5v0/liberty/gf180mcu_fd_sc_mcu7t5v0__tt_025C_5v00.lib
exec> read_liberty /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_io/liberty/gf180mcu_fd_io__tt_025C_5v00.lib
exec> read_liberty /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/liberty/gf180mcu_fd_ip_sram__sram128x8m8wm1__tt_025C_5v00.lib
exec> read_liberty /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/liberty/gf180mcu_fd_ip_sram__sram256x8m8wm1__tt_025C_5v00.lib
exec> read_liberty /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/liberty/gf180mcu_fd_ip_sram__sram512x8m8wm1__tt_025C_5v00.lib
exec> read_liberty /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/liberty/gf180mcu_fd_ip_sram__sram64x8m8wm1__tt_025C_5v00.lib
exec> read_lef /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_sc_mcu7t5v0/techlef/gf180mcu_fd_sc_mcu7t5v0__nom.tlef
[INFO ODB-0222] Reading LEF file: /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_sc_mcu7t5v0/techlef/gf180mcu_fd_sc_mcu7t5v0__nom.tlef
[INFO ODB-0388] unsupported LEF58_EOLENCLOSURE property for layer Via1 :"
  	EOLENCLOSURE 0.34 0.06 ;"
[INFO ODB-0388] unsupported LEF58_EOLENCLOSURE property for layer Via2 :" EOLENCLOSURE 0.34 0.06 ; "
[INFO ODB-0388] unsupported LEF58_EOLENCLOSURE property for layer Via3 :" EOLENCLOSURE 0.34 0.06 ; "
[INFO ODB-0388] unsupported LEF58_EOLENCLOSURE property for layer Via4 :" EOLENCLOSURE 0.34 0.06 ; "
[INFO ODB-0223]     Created 15 technology layers
[INFO ODB-0224]     Created 56 technology vias
[INFO ODB-0226] Finished LEF file:  /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_sc_mcu7t5v0/techlef/gf180mcu_fd_sc_mcu7t5v0__nom.tlef
exec> read_lef /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_sc_mcu7t5v0/lef/gf180mcu_fd_sc_mcu7t5v0.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_sc_mcu7t5v0/lef/gf180mcu_fd_sc_mcu7t5v0.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_sc_mcu7t5v0/lef/gf180mcu_fd_sc_mcu7t5v0.lef at line 2.

[INFO ODB-0225]     Created 229 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_sc_mcu7t5v0/lef/gf180mcu_fd_sc_mcu7t5v0.lef
exec> read_lef /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_io/lef/gf180mcu_fd_io.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_io/lef/gf180mcu_fd_io.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_io/lef/gf180mcu_fd_io.lef at line 2.

[WARNING ODB-0186] macro gf180mcu_fd_io__asig_5p0 references unknown site GF_IO_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__bi_24t references unknown site GF_IO_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__bi_t references unknown site GF_IO_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__brk2 references unknown site GF_IO_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__brk5 references unknown site GF_IO_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__cor references unknown site GF_COR_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__dvdd references unknown site GF_IO_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__dvss references unknown site GF_IO_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__fill1 references unknown site GF_IO_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__fill5 references unknown site GF_IO_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__fill10 references unknown site GF_IO_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__fillnc references unknown site GF_IO_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__in_c references unknown site GF_IO_Site
[WARNING ODB-0186] macro gf180mcu_fd_io__in_s references unknown site GF_IO_Site
[INFO ODB-0225]     Created 14 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_io/lef/gf180mcu_fd_io.lef
exec> read_lef /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram128x8m8wm1.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram128x8m8wm1.lef
[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram128x8m8wm1.lef
exec> read_lef /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram256x8m8wm1.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram256x8m8wm1.lef
[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram256x8m8wm1.lef
exec> read_lef /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram512x8m8wm1.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram512x8m8wm1.lef
[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram512x8m8wm1.lef
exec> read_lef /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram64x8m8wm1.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram64x8m8wm1.lef
[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref/gf180mcu_fd_ip_sram/lef/gf180mcu_fd_ip_sram__sram64x8m8wm1.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_core.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_core.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_core.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_core.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block_009.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block_009.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block_009.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block_009.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block_007.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block_007.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block_007.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block_007.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/open_source.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/open_source.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/open_source.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/open_source.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/mprj_io_buffer.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/mprj_io_buffer.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/mprj_io_buffer.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/mprj_io_buffer.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/housekeeping.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/housekeeping.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/housekeeping.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/housekeeping.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_motto.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_motto.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_motto.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_motto.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/user_project_wrapper.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/user_project_wrapper.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/user_project_wrapper.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/user_project_wrapper.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_power_routing.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_power_routing.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_power_routing.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_power_routing.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/user_project_wrapper_PnR.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/user_project_wrapper_PnR.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/user_project_wrapper_PnR.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/user_project_wrapper_PnR.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/user_id_programming.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/user_id_programming.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/user_id_programming.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/user_id_programming.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/chip_io.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/chip_io.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/chip_io.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/chip_io.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block_087.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block_087.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block_087.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/gpio_defaults_block_087.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/user_id_textblock.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/user_id_textblock.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/user_id_textblock.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/user_id_textblock.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/copyright_block.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/copyright_block.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/copyright_block.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/copyright_block.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/spare_logic_block.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/spare_logic_block.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/spare_logic_block.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/spare_logic_block.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_logo.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_logo.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_logo.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/lef/caravel_logo.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/mgmt_core_wrapper/lef/gf180_ram_512x8_wrapper.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/mgmt_core_wrapper/lef/gf180_ram_512x8_wrapper.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/mgmt_core_wrapper/lef/gf180_ram_512x8_wrapper.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/mgmt_core_wrapper/lef/gf180_ram_512x8_wrapper.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/lef/user_proj_example.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/lef/user_proj_example.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/lef/user_proj_example.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/lef/user_proj_example.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/lef/user_project_wrapper.lef
[WARNING ODB-0229] Error: library (user_project_wrapper) already exists
exec> read_lef /home/jangarita/ADC_LogiCompilation/lef/ADC_LogiCompilation.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/lef/ADC_LogiCompilation.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/lef/ADC_LogiCompilation.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/lef/ADC_LogiCompilation.lef
exec> read_lef /home/jangarita/ADC_LogiCompilation/caravel/macros/simple_por/lef/simple_por.lef
[INFO ODB-0222] Reading LEF file: /home/jangarita/ADC_LogiCompilation/caravel/macros/simple_por/lef/simple_por.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/jangarita/ADC_LogiCompilation/caravel/macros/simple_por/lef/simple_por.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/jangarita/ADC_LogiCompilation/caravel/macros/simple_por/lef/simple_por.lef
exec> read_def /home/jangarita/ADC_LogiCompilation/def/ADC_LogiCompilation.def
[INFO ODB-0127] Reading DEF file: /home/jangarita/ADC_LogiCompilation/def/ADC_LogiCompilation.def
[INFO ODB-0128] Design: ADC_LogiCompilation
[INFO ODB-0130]     Created 26 pins.
[INFO ODB-0131]     Created 96221 components and 321052 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 320344 connections.
[INFO ODB-0133]     Created 239 nets and 708 connections.
[INFO ODB-0134] Finished DEF file: /home/jangarita/ADC_LogiCompilation/def/ADC_LogiCompilation.def
exec> define_process_corner -ext_model_index 0 X
[INFO RCX-0431] Defined process_corner X with ext_model_index 0
[INFO RCX-0029] Defined extraction corner X
exec> extract_parasitics  -ext_model_file /home/jangarita/dependencies/pdks/gf180mcuD/libs.tech//openlane/rules.openrcx.gf180mcuD.nom  -lef_res
[INFO RCX-0008] extracting parasitics of ADC_LogiCompilation ...
[INFO RCX-0435] Reading extraction model file /home/jangarita/dependencies/pdks/gf180mcuD/libs.tech//openlane/rules.openrcx.gf180mcuD.nom ...
[INFO RCX-0436] RC segment generation ADC_LogiCompilation (max_merge_res 50.0) ...
[INFO RCX-0040] Final 795 rc segments
[INFO RCX-0439] Coupling Cap extraction ADC_LogiCompilation ...
[INFO RCX-0440] Coupling threshhold is 0.1000 fF, coupling capacitance less than 0.1000 fF will be grounded.
[INFO RCX-0043] 1557 wires to be extracted
[INFO RCX-0442] 10% completion -- 161 wires have been extracted
[INFO RCX-0442] 51% completion -- 802 wires have been extracted
[INFO RCX-0442] 62% completion -- 979 wires have been extracted
[INFO RCX-0442] 100% completion -- 1557 wires have been extracted
[INFO RCX-0045] Extract 239 nets, 1031 rsegs, 1031 caps, 1184 ccs
[INFO RCX-0015] Finished extracting ADC_LogiCompilation.
exec> write_spef /home/jangarita/ADC_LogiCompilation/signoff/ADC_LogiCompilation/openlane-signoff/spef/ADC_LogiCompilation.nom.spef
[INFO RCX-0016] Writing SPEF ...
[INFO RCX-0443] 239 nets finished
[INFO RCX-0017] Finished writing SPEF ...
exec> read_spef /home/jangarita/ADC_LogiCompilation/signoff/ADC_LogiCompilation/openlane-signoff/spef/ADC_LogiCompilation.nom.spef
spef: /home/jangarita/ADC_LogiCompilation/signoff/ADC_LogiCompilation/openlane-signoff/spef/ADC_LogiCompilation.nom.spef
def: /home/jangarita/ADC_LogiCompilation/def/ADC_LogiCompilation.def
rcx: /home/jangarita/dependencies/pdks/gf180mcuD/libs.tech//openlane/rules.openrcx.gf180mcuD.nom
rcx-corner: nom
lib-corner: t.tcl
tech_lef: /home/jangarita/dependencies/pdks/gf180mcuD/libs.ref//gf180mcu_fd_sc_mcu7t5v0/techlef/gf180mcu_fd_sc_mcu7t5v0__nom.tlef
